app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "oyfnuVYqDlSKMJK_9dd68w"], ["updated_at", "2020-09-21 17:50:00.354397"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save